{
    "homeIndex": "Əsas səhifə",
    "aboutIndex": "Haqqımızda",
    "featuresIndex": "Üstünlüklər",
    "servicesIndex": "Xidmətlər",
    "historyIndex": "Tarixçə",
    "contactIndex": "Əlaqə",
    "portfolioIndex": "Portfolio",
    "titleIndex": "Gələcəyi bizimlə qurun",
    "subtitleIndex": "Kiçikdən başla. Böyük düşün. Hər baytı kodla",
    "contactUsIndex": "Bizimlə əlaqə",
    "aboutUsIndex": "Haqqımızda",
    "aboutUsTextIndex": "ByteLab olaraq məqsədimiz gənc zəkaları praktiki dərslər, real layihələr və praktiki təcrübələr vasitəsilə proqramlaşdırma dünyasına yönləndirməkdir. Proqramlaşdırma öyrənməyin ən yaxşı yolu sınaqdan keçirmək və bu prosesdən zövq almaqdır. Kursumuz backend inkişafı (data struktur/alqoritm), verilənlər bazaları və Java, C# kimi müasir texnologiyalarda güclü təməl qurmaq üçün xüsusi olaraq hazırlanıb. Şagirdlər gələcəkdə ya mühəndis olmağı hədəfləyə və ya sadəcə texnologiyanın necə işlədiyini anlamaq istəyə bilərlər — ByteLab onlara texnologiya yolculuğunda ilk inamlı addımlarını atmağa kömək edir.",
    "aboutUsSyllabusIndex": "Kursa yazılmadan əvvəl dərslərimizdən nümunə dərslərə baxa və tədris planını nəzərdən keçirə bilərsiniz..",
    "aboutUsButtonIndex": "Tədris planı- Programlaşdırma Əsasları",
    "aboutUsButtonIndex2": "Tədris planı-Verilenlər Bazası İdarəetməsi",
    "aboutUsButtonIndex3": "Tədris planı- C-Shapr",
    "aboutUsButtonIndex4": "Tədris planı- Java",
    "backendDevelopmentIndex": "Backend Proqramlaşdırma",
    "backendDevelopmentIndex2": "Backend Proqramlaşdırma",
    "databaseManagementIndex": "Verilənlər Bazası İdarəetməsi",
    "demoLessonsIndex": "Nümunə Dərslər",
    "demoLessonsIndex2": "Nümunə Dərslər",
    "demoLessonsIndex3": "Nümunə Dərslər",
    "bookLessonIndex": "Dərsə Yazıl",
    "bookLessonIndex2": "Dərsə Yazıl",
    "bookLessonIndex3": "Dərsə Yazıl",
    "featuresTitleIndex": "Üstünlüklərİmİz",
    "featuresSubtitleIndex": "Yanaşmamız rahatlığı, yaradıcılığı və praktiki öyrənməni birləşdirməkdir.",
    "featuresItem1Index": "Rahat Öyrənmə Mühiti",
    "featuresItem1TextIndex": "Proqramlarımız tam onlayn keçirilir, beləliklə evdən çıxmadan öyrənə bilərsiniz. Yaxın aylarda açılacaq fiziki tədris məkanını da hazırlayırıq.",
    "featuresItem2Index": "Təcrübəyə əsaslanan öyrənmə",
    "featuresItem2TextIndex": "Praktika ilə öyrən! Hər mövzuya real kodlaşdırma tapşırıqları və bacarıqlarını addım-addım inkişaf etdirən mini layihələr daxildir.",
    "featuresItem3Index": "İki dildə tədris",
    "featuresItem3TextIndex": "Dərslərimizə Azərbaycan və ya Ingilis dillərində qoşula bilərsiniz, bu da öyrənmə prosesini sizə uygun daha rahat və anlaşılan edir.",
    "featuresItem4Index": "Video Dərslər",
    "featuresItem4TextIndex": "Şagirdlər dərsdən sonra materialları videonu izləyərək yenidən təkrar edə və heç bir mövzunu qaçırmadan öyrənə bilərlər.",
    "servicesTitleIndex": "Xidmətlərİmİz",
    "servicesSubtitleIndex": "Rəqəmsal ideyalarınızı həyata keçirən xidmətlərimiz mövcuddur.",
    "servicesItem1Index": "Backend Programlaşdırma Kursu",
    "servicesItem2Index": "Verilənlər Bazası İdarəetməsi",
    "servicesList1Index": "Alqoritmlər",
    "servicesList2Index": "Dizayn və Struktur",
    "servicesList3Index": "SQL sorğuları",
    "servicesList4Index": "Verilənlər bazasının backend ilə birləşdirilməsi",
    "servicesItem3TitleIndex": "Vebsaytın hazırlanması",
    "servicesItem3Index": "Biz həmçinin müasir (responsive) vebsaytlar dizayn edir və kodlayırıq.",
    "servicesList5Index": "Responsiv dizayn",
    "servicesList6Index": "Kodlaşdırma",
    "servicesList7Index": "Vebsaytı serverə yerləşdirmə",
    "servicesList8Index": "Dəstək",
    "codinTitleIndex": "Niyə Kodlaşdırma  Öyrənməli?",
    "codingDescIndex": "Kodlaşdırma sadəcə ekranda sətirlər yazmaq deyil — bu həm də gələcəyin başlangıcıdır. İstifadə etdiyin hər bir tətbiq, oyun və vebsayt, kodlaşdırma bacarığı olan biri tərəfindən yaradılıb. Bu, ideyalarınızı reallığa çevirən bir bacarıqdır. Kodlaşdırma öyrəndikcə, fərqli düşünməyi öyrənirsən. Sadəcə təlimatları izləmir —həm də problemləri həll edir, heç nədən bir şey yaradır və texnologiyanı öz xeyrinə işlədə bilirsən. Kodlaşdırma sənə ətrafındakı dünyanı formalaşdırmaq gücü verir , öz vebsaytını yaratmaqdan tutmuş insanlara fayda verən ağıllı sistemlər qurmağa qədər. Nə qədər tez başlasan, bir o qədər güclü rəqəmsal yaradıcılıq qazanarsan — və gələcək yaradıcı insanların olacaq.",
    "codingButtonIndex": "Nümunə Dərsə Yazıl",
    "contatctTitleIndex": "Bizimlə Əlaqə",
    "contatctSubTitleIndex": "Bizə müraciət edin və öyrənmə yolculuğunda növbəti addımı atın!",
    "contactAddressTitleIndex": "E-poçt ünvanı",
    "contactCallTitleIndex": "Zəng Edin",
    "contactWpTitleIndex": "WhatsApp",
    "contactWpSubTitleIndex": "Suallarınız var? O zaman bizə mesaj göndərin!",
    "contatFormNameIndex": "Adınız və Soyadınız",
    "contatFormEmailIndex": "E-poçt Ünvanınız",
    "contatFormSubjectIndex": "Başlıq",
    "contatFormMessageIndex": "Mesajınız",
    "contatFormButtonIndex": "Mesajınız yazın",
    "footerTitleIndex": "Bizi instagramda izləyin!",
    "portTitleIndex": "Portfolio",
    "portSubtitleIndex": "Proyektlərimizi nəzərdən keçirin",
    "portContact": "Daha çox məlumat üçün bizimlə əlaqə saxlayın!",
    "saffarmaDesc": "Bu layihə onlayn apteklər üçün stok idarəetmə sistemidir. Modul əsaslı backend həlli sayəsində sistem genişlənə bilir və asanlıqla idarə oluna bilər, müəssisə səviyyəli tətbiqlər üçün uyğundur. Layered Domain-Driven Design (DDD) və təmiz arxitektura prinsiplərinə əsaslanaraq, məlumat əldə etmə, biznes məntiqi, paylaşılan modellər və lokalizasiya resursları üzrə məsuliyyətləri aydın şəkildə ayırır.Sistem inventar, istifadəçilər və inzibati əməliyyatları idarə etmək üçün güclü və təhlükəsiz RESTful API-lər təqdim edir. İnteqrasiya olunmuş lokalizasiya dəstəyi və Docker ilə yerləşdirmə müxtəlif mühitlərdə elastikliyi, asan baxımı və ardıcıllığı təmin edir. Bu isə layihəni müasir DevOps iş axınları üçün ideal edir.",
    "saffarmaFeature": "Xüsusiyyətlər",
    "saffarmaFeature1": "Docker istifadəsi",
    "saffarmaFeature2": "İstifadəçilərin və əməliyyatların idarəsi",
    "saffarmaFeature3": "Təhlükəsiz API girişi təmin edən JWT əsaslı token avtorizasiyası",
    "saffarmaFeature4": "Enterprise səviyyəli tətbiqlər üçün genişlənə bilən dizayn",
    "saffarmaTech": "Texnologiyalar",
    "saffarmaTech1": "Təhlükəsiz, genişlənə bilən API-lər üçün ASP.NET Core",
    "saffarmaTech2": "Code-first miqrasiya ilə Entity Framework Core",
    "saffarmaTech3": "Rahat test edilə bilməsi üçün DI və interfeyslər",
    "saffarmaTech4": ".resx faylları və culture-based əsaslı yönləndirmə ilə lokalizasiya",
    "saffarmaTech5": "Konteyner əsaslı inkişaf üçün Docker &amp; Docker Compose",
    "saffarmaTech6": "Faylları saxlamaq üçün Amazon S3 istifadəsi (storage\buckets)",
    "saffarmaNote": "Şəkil və ya videoya tam ekranda baxa bilmək üçün üzərinə klik edin. Zəhmət olmasa nəzərə alın ki, təhlükəsizlik səbəblərinə görə kod/proyekt tam paylaşılmır.",
    "travelDesc": "Bu layihə səyahət platforması üçün hazırlanmış backend sistemidir. İstiqamətlərin, rezervasiyaların və istifadəçi məlumatlarının səmərəli idarə olunmasını təmin edir. Təmiz arxitektura prinsipləri ilə dizayn edilmiş sistem, bir neçə müştəri tətbiqini dəstəkləmək üçün təhlükəsiz və genişlənə bilən API xidmətləri təqdim edir. Sistem etibarlı məlumat emalı, avtorizasiya və biznes məntiqinin tətbiqinə fokuslanır və FrontEnd tərəfi ilə problemsiz inteqrasiyanı təmin edir.",
    "travelNote": "Şəkil və ya videoya klikləyin ki, tam ekranda baxasınız. Zəhmət olmasa qeyd edin ki, təhlükəsizlik səbəblərinə görə tam kod paylaşılmır.",
    "travelTech": "Texnologiyalar",
    "travelTech1": "Backend inkişafı üçün ASP.NET Core",
    "travelTech2": "Məlumat bazasının idarəsi üçün Entity Framework Core (Code First)",
    "travelTech3": "Etibarlı və strukturlaşdırılmış məlumatın saxıanması və idarəsi üçün SQL Server",
    "travelTech4": "Sessiyasız və təhlükəsiz avtorizasiya üçün JWT (JSON Web Tokens)",
    "travelTech5": "Rahat test edilə bilməsi üçün DI və interfeyslər",
    "travelFeature": "Xüsusiyyətlər",
    "travelFeature1": "Məlumatların rahat axtarış və filtr edilməsi",
    "travelFeature2": "İstifadəçilərin təhlükəsiz avtorizasiyası və profilin idarəetməsi",
    "travelFeature3": "Təhlükəsiz API girişi təmin edən JWT əsaslı token avtorizasiyası",
    "travelFeature4": "Səliqəli istifadəçi interfeysi ilə responsiv dizayn",
    "isoDesc": "Bu layihə ISO standartlarına əsaslanan hesabatların dəstəklənməsi və yaradılması üçün hazırlanmış iki hissəli tətbiqdir. Sistem istifadəçilərə məlumatları səmərəli şəkildə daxil etməyə, idarə etməyə və qiymətləndirməyə imkan verir və eyni zamanda ISO tələblərinə tam uyğunluğu təmin edir. Sistem HttpContext və təhlükəsiz API inteqrasiyası vasitəsilə problemsiz ünsiyyət quran iki bir-biri ilə bağlı tətbiqdən ibarətdir və modullar arasında dəqiq və sinxron əməliyyatları təmin edir. Üstünlükləri: - Gündəlik tapşırıqların və fəaliyyətlərin rəqəmsal həlli - Tapşırıqların icra vəziyyətinin real vaxt izlənməsi - Sübut sənədlərinin əlavə olunma imkanı - Məsul şəxslərə avtomatik e-poçt bildirişləri - Təqdim edilmiş tapşırıqlar üçün icra hesabatları - Hər tapşırıq avtomatik nömrələnir və qeydiyyata alınır",
    "isoNote": "Şəkil və ya videoya klikləyin ki, tam ekranda baxasınız. Zəhmət olmasa qeyd edin ki, təhlükəsizlik səbəblərinə görə tam kod paylaşılmır.",
    "isoTech": "Texnologiyalar",
    "isoTech1": "Backend üçün ASP.NET Core",
    "isoTech2": "Təhlükəsiz token əsaslı ünsiyyət ilə RESTful API-lər",
    "isoTech3": "Strukturlaşdırılmış məlumat saxlama üçün SQL Server",
    "isoTech4": "Rol əsaslı avtorizasiya və təhlükəsiz məlumat girişi",
    "isoFeature": "Xüsusiyyətlər",
    "isoFeature1": "ISO tələblərinə əsaslanan məlumat daxil etmə, izləmə və yoxlama",
    "isoFeature2": "Təhlükəsiz qarşılıqlı ünsiyyət ilə iki hissəli tətbiq",
    "isoFeature3": "API səviyyəsində təhlükəsiz idarəetmə",
    "isoFeature4": " Hesabatların yaradılması və qiymətləndirməsi",
    "isoFeature5": " Responsiv iş tənzimlənməsi və uyğunluğun izlənməsi üçün modullar"
}