{
    "homeIndex": "Home",
    "aboutIndex": "About",
    "featuresIndex": "Features",
    "servicesIndex": "Services",
    "historyIndex": "History",
    "contactIndex": "Contact",
    "portfolioIndex": "Portfolio",
    "titleIndex": "Build The Future With Us",
    "subtitleIndex": "Start Small, Think Big, Code Byte by Byte",
    "contactUsIndex": "Contact Us",
    "aboutUsIndex": "About Us",
    "aboutUsTextIndex": "At ByteLab, our mission is to guide young minds into the world of coding through hands-on lessons, real projects, and interactive labs. We believe that the best way to learn programming is by creating, experimenting, and having fun along the way. Each course is carefully designed to build a strong foundation in backend development, databases, and modern technologies like .NET and C#. Whether students dream of becoming developers, engineers, or simply want to understand how technology works, ByteLab helps them take their first confident steps toward a future in tech.",
    "aboutUsSyllabusIndex": "You can watch our demo lessons and preview syllabus to see how we teach before book a course",
    "aboutUsButtonIndex": "Syllabus-Programming Fundamentals",
    "aboutUsButtonIndex2": "Syllabus-Database Management",
    "aboutUsButtonIndex3": "Syllabus-NET framework",
    "backendDevelopmentIndex": "Backend Development",
    "backendDevelopmentIndex2": "Backend Development",
    "databaseManagementIndex": "Database Management",
    "demoLessonsIndex": "Demo Lessons",
    "demoLessonsIndex2": "Demo Lessons",
    "demoLessonsIndex3": "Demo Lessons",
    "bookLessonIndex": "Book a Lesson",
    "bookLessonIndex2": "Book a Lesson",
    "bookLessonIndex3": "Book a Lesson",
    "featuresTitleIndex": "Our Features",
    "featuresSubtitleIndex": "Our approach combines comfort, creativity, and hands-on learning",
    "featuresItem1Index": "Comfortable Learning Environment",
    "featuresItem1TextIndex": "Our programs are fully online, so you can learn without leaving home. We’re also preparing an on-site space that will open in the coming months.",
    "featuresItem2Index": "Practice-Based Learning",
    "featuresItem2TextIndex": "Learn by doing! Each topic includes real coding practice and fun mini projects to build your skills step by step.",
    "featuresItem3Index": "Multilingual Learning",
    "featuresItem3TextIndex": "You can join our lessons in English or Azerbaijani, making learning easier and more comfortable for everyone.",
    "featuresItem4Index": "Video Recorded After School",
    "featuresItem4TextIndex": "Students can review the material after school, catch up easily, and never miss a topic.",
    "servicesTitleIndex": "Our Services",
    "servicesSubtitleIndex": "Explore the services that bring your digital ideas to life.",
    "servicesItem1Index": "Backend Development Course",
    "servicesItem2Index": "Database Management",
    "servicesList1Index": "Alqoritmlər",
    "servicesList2Index": "Design and Structure",
    "servicesList3Index": "SQL queries",
    "servicesList4Index": "Connecting databases with backend",
    "servicesItem3TitleIndex": "Website development",
    "servicesItem3Index": "We design and build modern, responsive websites",
    "servicesList5Index": "Responsive design",
    "servicesList6Index": "Coding",
    "servicesList7Index": "Deploy website to server",
    "servicesList8Index": "Support",
    "codinTitleIndex": "Why Learn to Code?",
    "codingDescIndex": "Coding is more than typing lines on a screen — it’s the language of the future. Every app, game, and website you use was built by someone who knew how to code. It’s the skill that turns ideas into reality. When you learn coding, you learn how to think differently. You don’t just follow instructions — you solve problems, create things from nothing, and make technology work for you. From designing your own website to building smart systems that help people, coding gives you the power to shape the world around you. The earlier you start, the stronger your digital creativity becomes — and the future belongs to creators.",
    "codingButtonIndex": "Book a Demo Lesson",
    "contatctTitleIndex": "Contact Us",
    "contatctSubTitleIndex": "Reach out and take the next step in your learning journey",
    "contactAddressTitleIndex": "Email address",
    "contactCallTitleIndex": "Call Us",
    "contactWpTitleIndex": "Whatsapp",
    "contactWpSubTitleIndex": "Have a question? Send us a message and we’ll reply within 5 minutes!",
    "contatFormNameIndex": "FullName",
    "contatFormEmailIndex": "Email",
    "contatFormSubjectIndex": "Subject",
    "contatFormMessageIndex": "Message",
    "contatFormButtonIndex": "Send Message",
    "footerTitleIndex": "Follow Us on Instagram!",
    "portTitleIndex": "Portfolio",
    "portSubtitleIndex": "Explore our projects.",
    "portContact": "For more information, get in touch with us!",
    "saffarmaDesc": "This project is an online drugstore stock management system, a modular backend solution built to power a scalable and maintainable enterprise-level application. Developed using layered Domain-Driven Design (DDD) and clean architecture principles, it efficiently separates concerns across data access, business logic, shared models, and localization resources. The system provides robust and secure RESTful APIs for managing inventory, users, and administrative operations. With integrated localization support and Dockerized deployment, it ensures flexibility, maintainability, and consistency across different environments—making it well-suited for modern DevOps workflows.",
    "saffarmaFeature": "Features",
    "saffarmaFeature1": "Dockerized deployment for easy environment setup",
    "saffarmaFeature2": "Administrative tools for managing users and operations",
    "saffarmaFeature3": "JWT-based token authentication ensuring secure API access",
    "saffarmaFeature4": "Scalable design suitable for enterprise-level applications",
    "saffarmaTech": "Technologies",
    "saffarmaTech1": "ASP.NET Core for building secure, scalable APIs",
    "saffarmaTech2": "Entity Framework Core with code-first migrations",
    "saffarmaTech3": "Custom logic layer with DI and interfaces for testability",
    "saffarmaTech4": "Localization with .resx files and culture-based routing",
    "saffarmaTech5": "Docker & Docker Compose for containerized development",
    "saffarmaTech6": "Amazon S3 for scalable object storage (file/image uploads)",
    "saffarmaNote": "Click on the image or videos to see them fullscreen. Please note that the full code cannot be shared due to security reasons",
    "travelDesc":"This project is a robust backend system developed to power a travel platform enabling efficient management of destinations, bookings, and user data. Designed with clean architecture principles, it provides secure and scalable API services to support multiple client applications. The system focuses on reliable data processing, authentication, and business logic implementation, ensuring seamless integration with front-end clients or third-party services.",
    "travelNote":"Click on the image or videos to see them fullscreen. Please note that the full code cannot be shared due to security reasons",
    "travelTech": "Technologies",
    "travelTech1": "ASP.NET Core for backend development",
    "travelTech2": "Entity Framework Core (Code First) for database management",
    "travelTech3": "SQL Server for reliable and structured data storage",
    "travelTech4": "Localization with .resx files and culture-based routing",
    "travelTech5": "JWT (JSON Web Tokens) for stateless and secure authentication",
    "travelFeature": "Features",
    "travelFeature1": "Search and filter destinations with detailed travel information",
    "travelFeature2": "Secure user authentication and profile management",
    "travelFeature3": "JWT-based token authentication ensuring secure API access",
    "travelFeature4": "Responsive design with a clean and intuitive user interface",
    "isoDesc":"This project is a two-part application developed to support and generate reports based on ISO standards. It enables users to enter, manage, and evaluate data efficiently while maintaining full compliance with ISO requirements. The system consists of two interconnected applications that communicate seamlessly through HttpContext and secure API integration, ensuring accurate and synchronized operations between modules. Advantages: - Digital solution for compiling day-to-day tasks and actions - Real-time monitoring of task implementation status - Ability to attach evidence documents - Automatic email notifications to responsible persons - Implementation reports for assigned actions - Each task is automatically numbered and registered",
    "isoNote":"Click on the image or videos to see them fullscreen. Please note that the full code cannot be shared due to security reasons",
    "isoTech": "Technologies",
    "isoTech1": "ASP.NET Core for backend development",
    "isoTech2": "RESTful APIs with secure token-based communication",
    "isoTech3": "SQL Server for reliable and structured data storage",
    "isoTech4":"Role-based authorization and secure data access",
    "isoFeature": "Features",
    "isoFeature1": "Data input, tracking, and validation based on ISO requirements",
    "isoFeature2": "Two-part application with secure inter-communication",
    "isoFeature3": "API-level security and controlled access",
    "isoFeature4": "Report generation and evaluation tools",
    "isoFeature5": "Clear workflow and compliance monitoring modules"
}